# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.
# https://drive.google.com/file/d/1Ej_8Z0JNDy3FwYY_Xv4ThGMDIPg00KnN/view?usp=sharing


a = int(input("Введите номер буквы в алфавите: "))
na = a + 96
s = chr(na)
print(f'{s=}')
